[
  {
    "productName": "Apple Pencil Pro: Latest Model - Device Compatibility Check Required - Pixel-Perfect Precision, Tilt and Pressure Sensitivity, Perfect for Note-Taking, Drawing, and Art. Charges and Pairs Magnetically",
    "productSeller": "Amazon.com",
    "productCategory": "iPad Accessories",
    "productPrice": "$99.00",
    "productRating": "4.6",
    "deliveryDate": "Thursday, April 3",
    "description": "WHY APPLE PENCIL PRO — Apple Pencil Pro is loaded with intuitive features for ultimate creative control. Gestures and barrel roll let you access tools without interrupting your flow. Haptics allow you to feel shapes snap into place, and more. Apple Pencil hover on iPad Pro features pixel-perfect precision, tilt and pressure sensitivity, and low latency. Attaches magnetically for pairing, charging, and storage.\nCOMPATIBILITY — Apple Pencil Pro pairs and charges with iPad Pro 13-inch (M4), iPad Pro 11-inch (M4), iPad Air 13-inch (M2 and M4), iPad Air 11-inch (M2 and M4), and iPad mini (A17 Pro).\nADVANCED TOOLS — Apple Pencil Pro gives you ultimate creative control. Use gestures like squeeze and barrel roll to access tools, change brushes, and create strokes without missing a beat. Haptics allow you to feel shapes snap into place, and more. Use Apple Pencil hover on iPad Pro and iPad Air (M2 and M4) models to preview your mark before you make it, and now you can use Find My to locate your Apple Pencil Pro.\nEASY AND NATURAL — Apple Pencil Pro does it all with pixel-perfect precision, tilt and pressure sensitivity, and low latency. Featuring a flat edge, Apple Pencil Pro allows you to change tools with just the tap of a finger. Apple Pencil Pro attaches, charges, and pairs magnetically.\nTRANSFORMS IPAD INTO A CANVAS — Draw, sketch, color, take notes, and mark up documents. Use built-in apps like Notes and Freeform, or choose from over a million more apps available on the App Store. And for pros, use Apple Pencil hover on iPad Pro and iPad Air (M2) to preview your mark before you make it.\nApple Pencil Pro is sold separately. Compatible with iPad Pro (M4) and iPad Air (M2).",
    "imageUrl": [
      "https://m.media-amazon.com/images/I/41A7QLGVA6L._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81EETh9QZgL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/41iLLpfSWxL._AC_SL1500_.jpg"
    ]
  },
  {
    "productName": "Apple 2025 MacBook Air 13-inch Laptop with M4 chip: Built for Apple Intelligence, 13.6-inch Liquid Retina Display, 16GB Unified Memory, 256GB SSD Storage, 12MP Center Stage Camera, Touch ID; Sky Blue",
    "productSeller": "Amazon.com",
    "productCategory": "Mac laptops",
    "productPrice": "$949.99",
    "productRating": "4.7",
    "deliveryDate": "Thursday, April 3",
    "description": "SPEED OF LIGHTNESS — MacBook Air with the M4 chip lets you blaze through work and play. With Apple Intelligence,* up to 18 hours of battery life,** and an incredibly portable design, you can take on anything, anywhere.\nSUPERCHARGED BY M4 — The Apple M4 chip brings even more speed and fluidity to everything you do, like working between multiple apps, editing videos, or playing graphically demanding games.\nBUILT FOR APPLE INTELLIGENCE — Apple Intelligence is the personal intelligence system that helps you communicate, work, and create more efficiently across your Apple devices. With strict privacy protections, it gives you peace of mind that no one else can access your data — not even Apple.*\nUP TO 18 HOURS OF BATTERY LIFE — MacBook Air delivers the same incredible performance whether it’s running on battery or plugged in.**\nBRILLIANT DISPLAY — The 13.6-inch Liquid Retina display supports 1 billion colors.† Photos and videos pop with rich contrast and sharp detail, and text appears supercrisp.\nLOOK AND SOUND YOUR BEST — Everything looks and sounds amazing with a 12MP Center Stage camera, three-mic array, and four speakers with Spatial Audio.\nCONNECT IT ALL — MacBook Air features two Thunderbolt / USB 4 ports, a MagSafe charging port, a headphone jack, Wi-Fi 6E,‡ and Bluetooth 5.3. And connect up to two external displays (with the laptop lid closed).\nAPPLECARE WARRANTY — Every Mac comes with a one-year limited warranty and up to 90 days of complimentary technical support. Get AppleCare+ to extend your coverage.",
    "imageUrl": [
      "https://m.media-amazon.com/images/I/712dp0yAydL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71CJ4ZJQ6oL._AC_SL1200_.jpg",
      "https://m.media-amazon.com/images/I/71PUaDG0-FL._AC_SL1500_.jpg"
    ]
  },
  {
    "productName": "Apple 2024 MacBook Pro Laptop with M4 chip with 10-core CPU and 10-core GPU: Built for Apple Intelligence, 14.2-inch Liquid Retina XDR Display, 16GB Unified Memory, 512GB SSD Storage; Space Black",
    "productSeller": "Amazon.com",
    "productCategory": "Mac laptops",
    "productPrice": "$1,399.00",
    "productRating": "4.7",
    "deliveryDate": "Friday, April 4",
    "description": "SPEED OF SIGHT AND SOUND — MacBook Pro with the M4 chip lets you blaze through work and play. With Apple Intelligence,* up to 22 hours of battery life,** and the world’s best laptop display, you can conquer the most demanding workflows.\nSUPERCHARGED BY M4 — The Apple M4 chip brings industry-leading speed and efficiency to everything you do, like working between multiple apps, editing videos, or playing graphically demanding games.\nBUILT FOR APPLE INTELLIGENCE — Apple Intelligence is the personal intelligence system that helps you communicate, work, and create more efficiently across your Apple devices. With strict privacy protections, it gives you peace of mind that no one else can access your data — not even Apple.*\nUP TO 22 HOURS OF BATTERY LIFE — MacBook Pro delivers the same incredible performance whether it’s running on battery or plugged in.**\nBRILLIANT PRO DISPLAY — The 14.2-inch Liquid Retina XDR display features Extreme Dynamic Range, over 1000 nits of brightness for stunning HDR content, up to 600 nits of brightness for SDR content, and pro reference modes for doing your best work on the go.†\nFULLY COMPATIBLE — All your pro apps run lightning fast — including Adobe Creative Cloud, Apple Xcode, Microsoft 365, Medivis SurgicalAR, and many of your favorite iPhone and iPad apps.‡ And with macOS, work and play on your Mac are even more powerful. Elevate your presence on video calls. Access information in all-new ways. And discover even more ways to personalize your Mac.\nADVANCED CAMERA AND AUDIO — Look sharp and sound great with a 1080p FaceTime HD camera, a studio-quality three-mic array, and a six-speaker sound system with Spatial Audio.\nCONNECT IT ALL — This MacBook Pro features a MagSafe charging port, three Thunderbolt / USB 4 ports, an SDXC card slot, an HDMI port, and a headphone jack. Enjoy fast wireless connectivity with Wi-Fi 6E§ and Bluetooth 5.3. And connect up to two external displays (with the laptop lid open or closed).\nMAGIC KEYBOARD WITH TOUCH ID — The backlit Magic Keyboard has a full-height function key row and Touch ID, which gives you a fast, easy, secure way to unlock your laptop and sign in to apps and sites.\nADVANCED SECURITY — Every Mac comes with encryption, robust virus protections, and a powerful firewall system. And free security updates help keep your Mac protected.\nWORKS WITH ALL YOUR APPLE DEVICES — You can do amazing things when you use your Apple devices together. Copy something on iPhone and paste it on MacBook Pro. Use your MacBook Pro to answer FaceTime calls or send texts with Messages. And that’s just the beginning.\nBUILT TO LAST — The all-aluminum unibody enclosure is exceptionally durable. Free software updates keep things running smoothly for years to come.",
    "imageUrl": [
      "https://m.media-amazon.com/images/I/61-oTP1X4rL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61F6Ng0di0L._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81YaD2YWWlL._AC_SL1500_.jpg"
    ]
  },
  {
    "productName": "Apple iPhone 14, 128GB, Midnight - Unlocked (Renewed)",
    "productSeller": "ELECTRONIC DEALS",
    "productCategory": "Cell Phones & Accessories > Cell Phones",
    "productPrice": "$350.99",
    "productRating": "4.1",
    "deliveryDate": "Wednesday, April 2",
    "description": "This phone is unlocked and compatible with any carrier of choice on GSM and CDMA networks (e.g. AT&T, T-Mobile, Sprint, Verizon, US Cellular, Cricket, Metro, Tracfone, Mint Mobile, etc.).\nPlease check with your carrier to verify compatibility.\nWhen you receive the phone, insert a SIM card from a compatible carrier. Then, turn it on, connect to Wi-Fi, and follow the on-screen prompts to activate service.\nTested for battery health and guaranteed to have a minimum battery capacity of 80%.\nSuccessfully passed a full diagnostic test which ensures like-new functionality and removal of any prior-user personal information. The device does not come with headphones or a SIM card. It does include a generic (Mfi certified) charging cable and power adapter.\nInspected and guaranteed to have minimal cosmetic damage, which is not noticeable when the device is held at arm's length.",
    "imageUrl": [
      "https://m.media-amazon.com/images/I/61WUSYIQdKL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/41lENDon3NL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/614ltfkJQwL._AC_SL1000_.jpg"
    ]
  },
  {
    "productName": "Apple iPhone 16, US Version, 128GB, Black - Unlocked (Renewed)",
    "productSeller": "ELECTRONIC DEALS",
    "productCategory": "Cell Phones & Accessories > Cell Phones",
    "productPrice": "$685.00",
    "productRating": "4.1",
    "deliveryDate": "Wednesday, April 2",
    "description": "This pre-owned product is not Apple certified, but has been professionally inspected, tested and cleaned by Amazon-qualified suppliers.\nThere will be no visible cosmetic imperfections when held at an arm's length.\nThis product will have a battery which exceeds 80% capacity relative to new.\nAccessories may not be original, but will be compatible and fully functional. Product may come in generic box.\nThis product is eligible for a replacement or refund within 90 days of receipt if you are not satisfied.",
    "imageUrl": [
      "https://m.media-amazon.com/images/I/71QkWOSDkmL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61ck46a-96L._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/51Zk1ZeGvCL._AC_SL1500_.jpg"
    ]
  },
  {
    "productName": "Apple Watch Ultra 2 [GPS + Cellular 49mm] Smartwatch, Sport Watch with Black Titanium Case with Dark Green Alpine Loop - L. Fitness Tracker, Precision GPS, Action Button, Carbon Neutral",
    "productSeller": "Amazon.com",
    "productCategory": "Apple Watch",
    "productPrice": "$769.00",
    "productRating": "4.6",
    "deliveryDate": "Thursday, April 3",
    "description": "WHY APPLE WATCH ULTRA 2 RUGGED, CAPABLE, AND BUILT TO MEET THE DEMANDS OF ENDURANCE ATHLETES, OUTDOOR ADVENTURERS, AND WATER SPORTS ENTHUSIASTS — WITH A SPECIALIZED BAND FOR EACH. The S9 SiP enables a superbright display, and a magical new way to quickly and easily interact with your Apple Watch without touching the display. Up to 36 hours of battery life and 72 hours in Low Power Mode.1\nCARBON NEUTRAL — Apple Watch Ultra 2 paired with the latest Alpine Loop or Trail Loop is carbon neutral. Learn more about Apple’s commitment to the environment at apple.com/2030.3\nEXTREMELY RUGGED, INCREDIBLY CAPABLE — 49mm corrosion-resistant titanium case. Large Digital Crown and customizable Action button for instant control over a variety of functions. 100m water resistance.4\nBIGGEST, BRIGHTEST DISPLAY YET — Apple’s brightest Always-On Retina display is easy to see, even in harsh sunlight. More space for adding complications to customize your watch face and enough room to view six metrics at once.\nTHE FREEDOM OF CELLULAR — Cellular is built in.5 You can call and text without your iPhone, even abroad with international roaming.6 Stream your favorite music and podcasts. Get directions with Maps.\nFOR ATHLETES — Advanced metrics and views in the Workout app, including Heart Rate Zones, custom workouts, and new cycling workout views. Precision dual-frequency GPS provides incredible accuracy for calculating distance, pace, and route maps. Trail Loop band is thin, light, and flexible, designed for all workout types.\nFOR OUTDOOR ADVENTURERS — The Compass app delivers helpful views and details like elevation, incline, longitude, and latitude. See the last place where you had cellular reception. Mark your location with Compass Waypoints. Backtrack uses GPS to map where you’ve been so you can retrace your steps. Alpine Loop band is rugged and secure to meet the needs of hikers and climbers.\nFOR WATER SPORTS ENTHUSIASTS — Made for recreational water sports, scuba, and freediving for descents to 40 meters.4 The Depth app shows the time, current depth, water temperature, duration under water, and maximum depth you’ve reached. The Oceanic+ app puts a dive computer on your wrist.7 Ocean Band is light and flexible, with a titanium buckle and adjustable loop for a secure fit even during high-speed water sports.\nADVANCED HEALTH AND SAFETY FEATURES — Heart health notifications, the Blood Oxygen app,8 and the ECG app9 keep you informed and empowered when it comes to your health. Fall Detection10 and Crash Detection can connect you with emergency services in the event of a hard fall or a severe car crash.11 Hold the Action button to activate a siren that can be heard up to 600 feet away.",
    "imageUrl": [
      "https://m.media-amazon.com/images/I/81vLYHVwqjL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71l4XRVDGZL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81WbzL5nGyL._AC_SL1500_.jpg"
    ]
  },
  {
    "productName": "Gildan Men's Crew T-Shirts, Multipack, Style G1100",
    "productSeller": "Amazon.com",
    "productCategory": "Clothing, Shoes & Jewelry > Men > Clothing > Shirts > T-Shirts",
    "productPrice": "$14.44",
    "productRating": "4.6",
    "deliveryDate": "Not specified clearly, depends on selection.",
    "description": "Soft, breathable cotton\nMoisture wicking technology keeps you cool and dry\nTag-free for comfort\nClassic length for easy tucking\nDurabed stitching\nLay-flat collar",
    "imageUrl": [
      "https://m.media-amazon.com/images/I/710o0VupScL._AC_SX679_.jpg",
      "https://m.media-amazon.com/images/I/61aARaV0OJL._AC_SX679_.jpg",
      "https://m.media-amazon.com/images/I/81i56nk9QmL._AC_SY879_.jpg"
    ]
  },
  {
    "productName": "JUVER Men's Dress Shirts Solid Long Sleeve Stretch Wrinkle-Free Formal Shirt Business Casual Button Down Shirts",
    "productSeller": "Amazon.com",
    "productCategory": "Clothing, Shoes & Jewelry > Men > Clothing > Shirts > Button-Down Shirts",
    "productPrice": "$16.99",
    "productRating": "4.2",
    "deliveryDate": "Not specified clearly, depends on selection.",
    "description": "Flex fabric: The long sleeve dress shirt is made of stretch fabric,makes you move body easier;soft and comfortable with good breathability.\nWrinkle Free:Resilient fabrics make of high quality fibres, easy to care. The classic spread collar easily matches with a tie or bow tie.\nOccasion:Business/Wedding/Party/Dating, either for formal occasions or daily casual, this mens dress shirt is a perfect choice; It is also an ideal gift for family, lovers and friends.\nThe classic design ensures a staple in any wardrobe",
    "imageUrl": [
      "https://m.media-amazon.com/images/I/51rkKPruYvL._AC_SX679_.jpg",
      "https://m.media-amazon.com/images/I/51XUjFHdXsL._AC_SX679_.jpg",
      "https://m.media-amazon.com/images/I/71tg1Or2PfL._AC_SX679_.jpg"
    ]
  },
  {
    "productName": "Men's Short Sleeve T-Shirts Corduroy V Neck Ribbed Knit Stretch Casual Blouss Basic 2023 Summer Plain Solid Tops Shirt",
    "productSeller": "Gotitfromfitting",
    "productCategory": "Clothing, Shoes & Jewelry > Men > Clothing > Active > Active Shirts & Tees > T-Shirts",
    "productPrice": "$25.99",
    "productRating": "4.4",
    "deliveryDate": "April 11 - 22",
    "description": "[Material]：These tops are meticulously crafted from a soft and stretchy corduroy fabric blend, featuring 95% polyester and 5% spandex, offers lightweight breathability, and moisture-wicking properties that keep you dry, offering a cool and comfortable feel for spring and summer.\n[Features]：Designed with a loose ribbed knit, elastic fabric, solid color, basic design, short sleeves and fashionable v neck cut, casual and stylish yet ribbed knit texture for various occasions and body types.\n[Occasion]：Suitable for daily home, work, gym, outdoor activities, travel, shopping and other leisure activities.\n[Match]：This men's v neck t shirt is easily paired with various clothing items such as sweatpants, jeans, chinos, or shorts to create a casual everyday look. Its versatility makes it an essential item for any wardrobe.\n[Tips]：These mens corduroy shirts are machine washable, making care and maintenance easy. Please refer to the size chart before placing your order, not the Amazon size chart.",
    "imageUrl": [
      "https://m.media-amazon.com/images/I/71NjGBq4qUL._AC_SX679_.jpg",
      "https://m.media-amazon.com/images/I/71JDhHLqGtL._AC_SX679_.jpg",
      "https://m.media-amazon.com/images/I/71QMwqyrVfL._AC_SX679_.jpg"
    ]
  },
  {
    "productName": "Amazon Essentials Men's Classic-Fit 7\" Chino Short",
    "productSeller": "Amazon.com",
    "productCategory": "Clothing, Shoes & Jewelry > Men > Clothing > Shorts > Flat Front",
    "productPrice": "$18.90",
    "productRating": "4.4",
    "deliveryDate": "Thursday, April 3",
    "description": "CLASSIC FIT: Roomy through hip and thigh with straight leg. Sits at the waist.\nCHINO TWILL: Gently structured cotton twill that is naturally breathable with a garment wash for a soft, durable hand.\nEVERYDAY SHORTS: Classic khaki chino shorts in a mid-stretch, garment-washed twill for a relaxed vibe with lived-in comfort appeal.\nDETAILS: Zip fly with button closure, front slant pockets and button-through back pockets.\nLEG OPENING: 11 1/2\" on US size 32.\nINSEAM: 7\" on US size 32.",
    "imageUrl": [
      "https://m.media-amazon.com/images/I/61KT6jBGPiL._AC_SY879_.jpg",
      "https://m.media-amazon.com/images/I/611Yvth0LWL._AC_SY879_.jpg",
      "https://m.media-amazon.com/images/I/61KT6jBGPiL._AC_SY879_.jpg"
    ]
  },
  {
    "productName": "5 Pack Athletic Gym Mens Shorts - Workout Black Quick Dry Basketball Shorts with Pockets for Running Casual Activewear",
    "productSeller": "Amazon.com",
    "productCategory": "Clothing, Shoes & Jewelry > Men > Clothing > Active > Active Shorts",
    "productPrice": "$16.99",
    "productRating": "4.3",
    "deliveryDate": "Not specified clearly, depends on selection.",
    "description": "[Soft & Comfortable & Cost Effected]: Men's athletic shorts are made with soft fabric, upgraded in comfort, breathability and stretch, making you feel comfortable during gym or workout. 5 packs offer a more cost-effective choice than 1, 3 and 4 pack.\n[Fit & Lightweight]: Our men's gym shorts feature an elastic waistband with an inside drawstring. Whether you're running or training, our shorts offer a comfortable fit that stays up till intense training you get the perfect fit every time.\n[Pockets Design]: Our mens workout shorts have pockets on both sides, convenient for carrying phone, keys, card, or cash. No worry about falling out when moving.\n[Quick Dry & Stretchable]: Made with polyester fabric, mens basketball shorts are quick dry and stretchable. They are perfect for basketball, running, exercise, fitness, workout, jogging, training, gym and casual wear.\n[Easy Care]: Machine wash cold, do not bleach. Tumble dry low.",
    "imageUrl": [
      "https://m.media-amazon.com/images/I/716A1Qb6zXL._AC_SX679_.jpg",
      "https://m.media-amazon.com/images/I/71IKUJHtjoL._AC_SX679_.jpg",
      "https://m.media-amazon.com/images/I/71Zuv5i2yYL._AC_SX679_.jpg"
    ]
  },
  {
    "productName": "Fashion Men's Henley Shirts Classic Short Sleeve Casual Button Cotton Tee T-Shirt with Pocket",
    "productSeller": "Dorry Coutrue",
    "productCategory": "Clothing, Shoes & Jewelry > Men > Clothing > Shirts > T-Shirts",
    "productPrice": "$19.99",
    "productRating": "4.2",
    "deliveryDate": "Thursday, April 3",
    "description": "Mens Shirts Fabric: The short sleeve henley shirt is made of premium cotton fabric with a little stretchy. Lightweight, breathable and comfortable material.\nClassic Style: This basic henley t shirt designed in 3-button placket closure, and a front pocket on the chest, builds a casual daily look.\nTops Match: This fashion crewneck t-shirt could be matched with stylish jeans, chinos or casual pants for daily wear, or wear with sport pants for workout.\nOccasion: This mens short sleeve t shirt is suitable for spring, summer and autumn. Great for daily wear, work, sports, vacation, beach and etc.\nGarment Care: Machine wash.",
    "imageUrl": [
      "https://m.media-amazon.com/images/I/71PvPsQ12zL._AC_SX679_.jpg",
      "https://m.media-amazon.com/images/I/716RM1hVFRL._AC_SX679_.jpg",
      "https://m.media-amazon.com/images/I/81cO+3pRPRL._AC_SX679_.jpg"
    ]
  },
  {
    "productName": "Match Men's Wild Cargo Pants",
    "productSeller": "Match Garments",
    "productCategory": "Clothing, Shoes & Jewelry > Men > Clothing > Pants > Casual",
    "productPrice": "$31.99",
    "productRating": "4.0",
    "deliveryDate": "Thursday, April 3",
    "description": "RELAXED FIT. Straight leg style. These cargo pants sit at the natural waist. Designed with a relaxed fit through the seat and thigh, these men's casual wear will keep you comfortable during any task. A waistband offers extra support with your favorite belt. These pants will make another great staple item that easily pairs with basic shirts, and will make another great addition to any man's wardrobe.\nMAXIMUM STORAGE. Featuring hardwearing fabric with side-seam cargo pockets.\nEASY CARE COTTON. DURABLE TWILL FABRIC WITH A GARMENT WASH & SOFT FINISH.\nLEFT LEG FLAP POCKET WITH NO BUTTON, RIGHT LEG FLAP POCKET WITH BUTTON. LEFT REAR FLAP POCKET WITH BUTTON, RIGHT REAR FLAP POCKET WITH NO BUTTON. ZIPPER FLY & BUTTON CLOSURE.\nPLEASE CHECK THE SIZE CHART BEFORE ORDERING.",
    "imageUrl": [
      "https://m.media-amazon.com/images/I/61NzUMZGdhL._AC_SY879_.jpg",
      "https://m.media-amazon.com/images/I/71aEHmirJ4L._AC_SY879_.jpg",
      "https://m.media-amazon.com/images/I/812QFziMDQL._AC_SY879_.jpg"
    ]
  },
  {
    "productName": "Levi's Men's 559 Relaxed Straight Jeans (Also Available in Big & Tall)",
    "productSeller": "Amazon.com",
    "productCategory": "Clothing, Shoes & Jewelry > Men > Clothing > Jeans",
    "productPrice": "$41.69",
    "productRating": "4.5",
    "deliveryDate": "Thursday, April 3",
    "description": "Sits below waist\nExtra room through seat and thigh\nThe model in the image is 6' 1\" and is wearing 32 x 32.\nFront rise: 11 1/4\", Knee: 18 1/4\", Leg opening: 16\", Measurements based on size 32\nMachine wash cold - normal cycle. wash inside out with like colors, do not bleach, tumble dry medium, warm iron, dry clean possible",
    "imageUrl": [
      "https://m.media-amazon.com/images/I/5137bplE4kL._AC_SX679_.jpg",
      "https://m.media-amazon.com/images/I/41gS9EkxXqL._AC_SX679_.jpg",
      "https://m.media-amazon.com/images/I/51ZLGapIQkL._AC_SX679_.jpg"
    ]
  },
  {
    "productName": "Straight Leg Jeans for Women,High Waisted Wide Leg Loose Microelastic Boyfriend Denim Pants",
    "productSeller": "Brand: Eomenie",
    "productCategory": "Clothing, Shoes & Jewelry > Women > Clothing > Jeans",
    "productPrice": "$33.39",
    "productRating": "4.1",
    "deliveryDate": "Not specified clearly, depends on selection.",
    "description": "NOTE:The product size is measured manually and may have a discrepancy of 1-2 cm. Please noted that the size in size char is the size of the jeans, not the body size. Stylish High-Rise Design: This pair of high-rise, straight-cut, wide-leg boyfriend jeans boasts a trendy high waist design, exuding a unique fashion-forward feel that combines Y2K vintage appeal with a contemporary twist.\nComfortable Relaxed Fit: The wide-leg design provides a comfortable wearing experience, showcasing a laid-back and casual boyfriend style that allows you to move with ease in any situation.\nFunctional Multi-Pocket Design: These high-waisted straight jeans feature five practical and stylish pockets, allowing you to carry small essentials effortlessly and seamlessly integrating them into your daily life.\nVersatile Pairing Options: These women's wide-leg jeans effortlessly complement various tops and footwear choices, such as crop tops, tank tops, t-shirts, sneakers, or high heels. They adapt to different occasions, including daily wear, school, office, shopping, travel, parties, holidays, and dates.\nPremium Denim Fabric: Crafted from high-quality micro-stretch denim fabric (70.1% Cotton,23.5% Polyester,5.2% regenerated cellulose,1.2% spandex), these jeans offer a soft, breathable, and durable wear. They maintain their shape even after multiple washes, ensuring long-lasting comfort and style.",
    "imageUrl": [
      "https://m.media-amazon.com/images/I/71c-lQM7JKL._AC_SY879_.jpg",
      "https://m.media-amazon.com/images/I/81nmmP8Y2jL._AC_SY879_.jpg",
      "https://m.media-amazon.com/images/I/7196gWPNVVL._AC_SY879_.jpg"
    ]
  },
  {
    "productName": "Amazon Essentials Slim Fit Jeans For Men",
    "productSeller": "Amazon.com",
    "productCategory": "Clothing, Shoes & Jewelry > Men > Clothing > Jeans",
    "productPrice": "$23.30",
    "productRating": "4.3",
    "deliveryDate": "Thursday, April 3",
    "description": "SLIM FIT: Modern slim fit jeans sit low on the waist are slim fit through the leg with a narrow leg opening.\nSTRETCH DENIM: Made from mid-weight cotton denim with a hint of stretch, these slim fit jeans provide comfort all day. These jeans come in indigo denim washes or solid colors with a garment wash for a lived in look and feel.\nJEAN DETAILS: 5-pocket styling with a zipper fly and button closure.\nLEG OPENING: 7 1/4\" on US size 32.\nINSEAM: Offered in 28\", 29\", 30\", 32\", 34\" inseams.",
    "imageUrl": [
      "https://m.media-amazon.com/images/I/81Pzmz66+SL._AC_SY879_.jpg",
      "https://m.media-amazon.com/images/I/61XaglRjfmL._AC_SX679_.jpg",
      "https://m.media-amazon.com/images/I/71V4EnYfIHL._AC_SY879_.jpg"
    ]
  },
  {
    "productName": "Blackberries, 6 oz",
    "productSeller": "Amazonfresh",
    "productCategory": "Grocery (implied from Fresh)",
    "productPrice": "$1.99",
    "productRating": "4.7",
    "deliveryDate": "Tomorrow 11 AM - 1 PM",
    "description": "Grown in United States, Chile, or Mexico\nBlackberries taste best when they are very dark purplish-black to black and plump.\nThese berries are rich in antioxidants, especially in vitamin C.",
    "imageUrl": [
      "https://m.media-amazon.com/images/I/71Ia-osdbkL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61U8YkBibvL._SL1479_.jpg",
      "https://m.media-amazon.com/images/I/71Ia-osdbkL._SL1500_.jpg"
    ]
  },
  {
    "productName": "Amazon Fresh, Cage Free, Brown Eggs, Grade A, 18 Count (Previously Happy Belly, Packaging May Vary)",
    "productSeller": "Amazonfresh",
    "productCategory": "Grocery (implied from Fresh)",
    "productPrice": "$8.99",
    "productRating": "4.6",
    "deliveryDate": "Tomorrow 11 AM - 1 PM",
    "description": "INCLUDES: 18 count of Brown and Cage-Free, Grade A Eggs.\nNEW LOOK: You may receive Happy Belly products as we transition to the new Amazon Fresh family!\nPackaging may vary, but the product and quality you love are exactly the same.\nHIGH QUALITY, LOW PRICE: Amazon Fresh brand products are all about high-quality food that fits your budget every day.\nONLY FROM AMAZON: Look for the Amazon Fresh label to find great deals on a wide selection of grocery essentials.",
    "imageUrl": [
      "https://m.media-amazon.com/images/I/71e-6ghPv0L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/717e3i7NDCL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71VPPh1ojXL._SL1500_.jpg"
    ]
  },
  {
    "productName": "Organic Broccoli, 1 Each",
    "productSeller": "Amazonfresh",
    "productCategory": "Grocery (implied from Fresh)",
    "productPrice": "$2.79",
    "productRating": "4.7",
    "deliveryDate": "Tomorrow 11 AM - 1 PM",
    "description": "Broccoli is an excellent source of vitamins K, C, and A, as well as folate and fiber\nThese delicious florets can be enjoyed raw with dip, as a side with cheese, in soup, or grilled with a variety of seasonings\nKeep unwashed broccoli refrigerated",
    "imageUrl": [
      "https://m.media-amazon.com/images/I/81w4CCxS1uL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71W6ZXgJ9HS._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81epzATvaWS._SL1500_.jpg"
    ]
  },
  {
    "productName": "Legendary Whitetails Men's Buck Camp Flannel, Long Sleeve Plaid Button Down Casual Shirt, Corduroy Cuffs",
    "productSeller": "Amazon.com",
    "productCategory": "Clothing, Shoes & Jewelry > Men > Clothing > Shirts > Button-Down Shirts",
    "productPrice": "$35.99",
    "productRating": "4.6",
    "deliveryDate": "Thursday, April 3",
    "description": "[Relaxed Fit]: Refer to our size chart for the ideal fit; The Buck Camp Flannel Shirt runs large to highlight the chest and body; Offering comfortable and stylish construction, double-pleated back ensures ease of movement without any pulling or tugging; Adheres to care instructions on the inner tag for hassle-free maintenance\n[Quality of Material]: Legendary Whitetails flannel shirt for men, recognized for its top-tier quality, is crafted from 100% soft brushed Cotton Flannel; It promises exceptional comfort and longevity, standing out in the realm of men's apparel; the traditional plaid pattern adds a timeless touch to this essential wardrobe piece\n[Unmatched Comfort]: Our plaid shirts for men blend ruggedness with refinement; Featuring a corduroy-lined collar and cuffs, our button-down shirt not only enhances comfort but also prevents wear and tear; The design maintains a sharp look, making it a perfect staple for any man's wardrobe\n[Functionality]: Our button-down long-sleeve shirts for men have a classic design and functional chest pocket adorned with a pencil slot, secured with a button closure for practicality; Left chest pocket allows you to conveniently store your belongings; Finished with an embroidered Signature Buck logo, it adds a distinctive Legendary Whitetails touch\n[Versatility]: The Men's Flannel Long Sleeve Shirt is a versatile piece, suitable for various settings from outdoor adventures to casual get-togethers; It's designed for hunting, fishing, hiking, or simply enjoying a relaxed day; This plaid shirt for men effortlessly transitions between different activities, ensuring you're appropriately dressed for any occasion",
    "imageUrl": [
      "https://m.media-amazon.com/images/I/91yuQ3m+cvL._AC_SX679_.jpg",
      "https://m.media-amazon.com/images/I/91oVJC4DNiL._AC_SY879_.jpg",
      "https://m.media-amazon.com/images/I/81sCMm2QpQL._AC_SY879_.jpg"
    ]
  },
  {
    "productName": "Logitech G Yeti GX Dynamic RGB Gaming Microphone, Podcast with LIGHTSYNC, Blue VOICE, G HUB Control, Supercardioid, USB Plug and Play on PC/MAC - Black",
    "productSeller": "Amazon.com",
    "productCategory": "Musical Instruments > Microphones & Accessories > Microphones > Dynamic Microphones > Multipurpose",
    "productPrice": "$106.99",
    "productRating": "4.6",
    "deliveryDate": "Thursday, April 3",
    "description": "Dynamic Mic Capsule: This broadcast-style dynamic mic capsule is specifically designed for gamers; its supercardiod pattern focuses on your voice, ignoring key clicks and background noise\nDual RGB zones: Use LIGHTSYNC to control two separate RGB light zones on the mic and sync them with other Logitech G gaming gear in G HUB for a fully immersive experience\nBlue VO!CE filters: Make your voice sound more professional and entertaining; add fun Blue VO!CE filters, effects and samples to entertain and engage your audience on stream\nSmart Audio Lock: smartly adjusts your gain by using an analog limiter to prevent clipping and a downward expander to reduce ambient background noise\nSleek, gamer-friendly design: Yeti GX looks great on your stream with its bold, clean aesthetic, classic G gaming gear — it looks great on your desk or mounted to a boom arm\nMounting versatility: Use the included desktop stand or attach Yeti GX to a boom arm (sold separately) for ultimate setup flexibility\nTotal G HUB Control: Control your Yeti GX mic settings right from G HUB; adjust RGB lighting, mic gain, Blue VO!CE settings and more\nMade with recycled plastic: Plastic parts include certified post consumer recycled plastic (Black 71%, White 74%)\nResponsibly-sourced packaging: Paper packaging comes from FSC-certified forests",
    "imageUrl": [
      "https://m.media-amazon.com/images/I/61YTNgk4vUL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "https://m.media-amazon.com/images/I/71WQuCyqlLL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71xFXExG+JL._AC_SL1500_.jpg"
    ]
  },
  {
    "productName": "Apple AirPods Max Wireless Over-Ear Headphones, Pro-Level Active Noise Cancellation, Transparency Mode, Personalized Spatial Audio, USB-C Charging, Bluetooth Headphones for iPhone - Midnight",
    "productSeller": "Amazon.com",
    "productCategory": "Apple Headphones",
    "productPrice": "$529.99",
    "productRating": "4.6",
    "deliveryDate": "Thursday, April 3",
    "description": "ULTIMATE OVER-EAR LISTENING EXPERIENCE — Apple-designed dynamic driver provides high-fidelity audio. Computational audio combines custom acoustic design with the Apple H1 chip and software for breakthrough listening experiences.\nFIVE FRESH COLORS — Available now and in five fresh colors: Midnight, Starlight, Blue, Purple, and (PRODUCT)RED. Engrave your AirPods Max for free. Smart Case is also included.\nFOCUS ON WHAT’S PLAYING — Pro-level Active Noise Cancellation removes up to 2x more background noise, so you can immerse yourself in music.¹\nHEAR THE WORLD AROUND YOU — Transparency mode lets you comfortably hear and interact with the world around you.\nPERSONALIZED SPATIAL AUDIO — With sound that suits your unique ear shape along with dynamic head tracking, AirPods Max deliver an immersive listening experience that places sound all around you.² You can also listen to select songs, shows, and movies in Dolby Atmos.\nACOUSTIC-FIRST DESIGN — Designed with a knit-mesh canopy and memory foam ear cushions for an exceptional over-ear fit that perfectly seals in sound.\nMAGICAL EXPERIENCE — Pair AirPods Max by simply placing them near your device and tapping Connect on your screen.³ AirPods Max intelligently pause when you take them off. And Automatic Switching makes listening between your iPhone, iPad, and Mac completely effortless.⁴\nLONGER BATTERY LIFE – Enjoy up to 20 hours of listening time with Active Noise Cancellation and Personalized Spatial Audio enabled.⁵ Simply charge AirPods Max via the USB-C connector. A 5-minute charge delivers 1.5 hours of listening.\nMAGSAFE CHARGING CASE — The MagSafe Charging Case works with USB-C. Store your AirPods Max in the Smart Case to put them in an ultra-low power state.\nAPPLECARE — Get up to two years of unlimited incidents of accidental damage protection and priority access to Apple experts with AppleCare+.⁶",
    "imageUrl": [
      "https://m.media-amazon.com/images/I/715izx6g41L._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/7126ArVSlkL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71OY9QJu6qL._AC_SL1500_.jpg"
    ]
  },
  {
    "productName": "Kerrygold Pure Irish Butter, Salted, 8 oz",
    "productSeller": "Amazonfresh",
    "productCategory": "Grocery (implied from Fresh)",
    "productPrice": "$3.69",
    "productRating": "4.8",
    "deliveryDate": "Tomorrow 11 AM - 1 PM",
    "description": "KERRYGOLD PURE IRISH BUTTER: Made from the milk of grass-fed cows, our pure Irish butter is rich and soft. From salted butter to unsalted, garlic and herb to reduced fat, Kerrygold butter elevates your dishes.\nALL NATURAL, ALL THE TIME: Kerrygold Salted Butter is made of pasteurized cream and salt for a fresh taste, or enhance the flavor of your baking & cooking.\nKERRYGOLD BUTTER: Made from the milk of grass-fed cows, our pure Irish butter is made on family farms from the milk of cows that graze on Irish fields for a richer taste.\nA TRADITION OF FLAVOR: The winds, rain and warming influence of the Gulf Stream all contribute to the lush greenery that has been the mainstay of Irish dairy farming for centuries.\nLEADING THE WAY: Our TASTE OF HOME cooperative model is farmer owned and operated, empowering our farming families to thrive in the Irish countryside for generations to come.",
    "imageUrl": [
      "https://m.media-amazon.com/images/I/81BkFw7uWKL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/91i1WSzDmmL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/31Aum+5Aw3L.jpg"
    ]
  },
  {
    "productName": "Blackberries, 6 oz",
    "productSeller": "Amazonfresh",
    "productCategory": "Grocery (implied from Fresh)",
    "productPrice": "$1.99",
    "productRating": "4.7",
    "deliveryDate": "Tomorrow 11 AM - 1 PM",
    "description": "Grown in United States, Chile, or Mexico\nBlackberries taste best when they are very dark purplish-black to black and plump.\nThese berries are rich in antioxidants, especially in vitamin C.",
    "imageUrl": [
      "blackberry_bowl_2.jpg",
      "blackberry_pack_2.jpg",
      "blackberry_closeup_2.jpg"
    ]
  },
  {
    "productName": "SOUR PATCH KIDS Bunnies Soft & Chewy Easter Candy, 18 Snack Packs",
    "productSeller": "Amazonfresh",
    "productCategory": "Grocery (implied from Fresh)",
    "productPrice": "$9.30",
    "productRating": "4.7",
    "deliveryDate": "Tomorrow 11 AM - 1 PM",
    "description": "One bag, 18 snack packs of SOUR PATCH KIDS Bunnies Soft & Chewy Easter Candy\nChewy snacks in assorted fruit flavors that are SOUR. SWEET. GONE.\nBunny-shaped, fat free candy, for a bit of fun and mischief\nPerfect for Easter baskets, Easter egg hunts, parties, and springtime celebrations\nIndividual treat bags are perfect for snacking and sharing",
    "imageUrl": [
      "https://m.media-amazon.com/images/I/81ABkwyRFwL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/91ltKgKZHJL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/A1DzmJXiyZL._SL1500_.jpg"
    ]
  },
  {
    "productName": "Red Raspberries, 6 oz",
    "productSeller": "Amazonfresh",
    "productCategory": "Grocery (implied from Fresh)",
    "productPrice": "$3.29",
    "productRating": "4.6",
    "deliveryDate": "Tomorrow 11 AM - 1 PM",
    "description": "Wash before consuming\nGrown in United States, Mexico\nRaspberries are delicious on their own as a healthy snack or as part of a recipe\nStore in the refrigerator for maximum shelf life",
    "imageUrl": [
      "https://m.media-amazon.com/images/I/71CJQWqAxFL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/517CVXTBJnL.jpg",
      "https://m.media-amazon.com/images/I/31VZ7hmdocL.jpg"
    ]
  },
  {
    "productName": "New Apple iPad 11-inch: A16 chip, 11-inch Model, Liquid Retina Display, 128GB, Wi-Fi 6, 12MP Front/12MP Back Camera, Touch ID, All-Day Battery Life — Blue",
    "productSeller": "Amazon.com",
    "productCategory": "iPad",
    "productPrice": "$327.00",
    "productRating": "4.7",
    "deliveryDate": "Friday, April 4",
    "description": "WHY IPAD — The 11-inch iPad is now more capable than ever with the superfast A16 chip, a stunning Liquid Retina display, advanced cameras, fast Wi-Fi, USB-C connector, and four gorgeous colors.* iPad delivers a powerful way to create, connect, and get things done.\nPERFORMANCE AND STORAGE — The powerful A16 chip makes iPad great in performance for your favorite activities. And with all-day battery life, iPad is perfect for playing immersive games and editing photos and videos.** Storage starts at 128GB and goes up to 512GB.†\n11-INCH LIQUID RETINA DISPLAY — The gorgeous Liquid Retina display is an amazing way to watch movies and shows or create incredible art. True Tone adjusts the display to the color temperature of the room to make viewing comfortable in any light.\niPadOS + APPS — iPadOS makes iPad more productive, intuitive, and versatile. With iPadOS, run multiple apps at once, use Apple Pencil to write in any text field with Scribble, and edit and share photos.†† Stage Manager makes multitasking easy with resizable, overlapping apps and external display support.* iPad comes with essential apps like Safari, Messages, and Keynote, with over a million more apps available on the App Store.\nAPPLE PENCIL AND MAGIC KEYBOARD — Apple Pencil (USB-C) and Apple Pencil (1st generation) transform iPad into an immersive drawing and note‑taking device. Magic Keyboard Folio features a great typing experience and a trackpad, while doubling as a protective cover. Accessories sold separately.\nADVANCED CAMERAS — iPad features a landscape 12MP Ultra Wide front camera that supports Center Stage for videoconferencing or epic Portrait mode selfies. The 12MP Wide back camera is perfect for capturing photos or shooting 4K video. And get great audio with dual studio-quality mics and landscape stereo speakers.\nCONNECTIVITY — Wi-Fi 6 gives you fast wireless connectivity to transfer files, play multiplayer games, and stream movies.‡ And when you’re away from Wi-Fi, superfast 5G cellular delivers flexibility to stay connected in more places.§ Connect to external displays, drives, and more using the USB-C connector.\nTOUCH ID — Unlock your iPad, sign in to apps, and make secure payments with Apple Pay, all with just the touch of a finger.",
    "imageUrl": [
      "https://m.media-amazon.com/images/I/61aPY8odPSL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81yW4V07UbL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71jaNelJpYL._AC_SL1500_.jpg"
    ]
  },
  {
    "productName": "Panasonic 65\" Z95 Series (newest model) OLED 4K Ultra HD Smart Fire TV, Dolby Vision IQ, HDR10+ Adaptive, Fire TV Ambient Experience, 144Hz Refresh Rate, Hands-Free with Alexa",
    "productSeller": "Amazon.com",
    "productCategory": "Amazon Devices & Accessories > Amazon Devices > Fire TV > Smart TVs",
    "productPrice": "$2,319.00",
    "productRating": "4.2",
    "deliveryDate": "Tuesday, March 31",
    "description": "A Smart TV with Stunning Color Accuracy and Brightness: The latest OLED panel with micro lens array technology and HCX Pro AI Processor MKII bring immersive entertainment experience.\nHeats rock bottom with Optimal Picture thru AI Auto Sensing: HDR10+, HDR10, HDR Dolby Vision, and HLG, formats supported. Filmmaker Mode enhanced, Dolby Vision IQ, HDR10+ Adaptive faithfully optimized natural picture that adjusts to room brightness.\n360 Soundscape Pro Tuned by Technics: Integrated front, array, upward and side-firing speakers with Dolby Atmos for immersive positional sound. Customize audio for a picture perfect pairing. You can set your home screen to display curated art pieces or personal photos. Set up widgets to see weather, stream music, take notes, and view reminders.\nMore immersive Gaming Experience with the latest gaming features like HDMI2.1, 146Hz refresh rate, VRR, AMD FreeSync Premium, NVIDIA G-SYNC. Choose between two gaming sound modes specifically optimized for the genre of game you are playing. Control your Gaming PC from your TV via the built-in Game Control Board, access your game settings status.\nAll your entertainment in one place: Fire TV brings your favorite live TV, movies, shows, and games into one place. Connect your TV antenna to watch free live TV, or subscribe to apps like Sling TV, YouTube TV, and DIRECTV STREAM. Stream millions of songs with Amazon Music.\nAlexa Enabled and Voice Remote: Conveniently control your smart TV with the built-in mic or voice remote. Easily find your favorites, and even get personalized recommendations.\nSee more product details",
    "imageUrl": [
      "https://m.media-amazon.com/images/I/71Gf-uSubiL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81OzAhNde2L._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/71HXxrMi-OL._AC_SL1300_.jpg"
    ]
  },
  {
    "productName": "Medium Hass Avocado",
    "productSeller": "Amazonfresh",
    "productCategory": "Grocery (implied from Fresh)",
    "productPrice": "$0.99",
    "productRating": "4.6",
    "deliveryDate": "Tomorrow 11 AM - 1 PM",
    "description": "Grown in Mexico or California",
    "imageUrl": [
      "https://m.media-amazon.com/images/I/81LKLCmdAQL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81LKLCmdAQL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81LKLCmdAQL._SL1500_.jpg"
    ]
  },
  {
    "productName": "Apple AirPods Pro 2 Wireless Earbuds, Bluetooth Headphones, Active Noise Cancellation, Hearing Aid Feature, Transparency, Personalized Spatial Audio, High-Fidelity Sound, HZ Chip, USB-C Charging",
    "productSeller": "Amazon.com",
    "productCategory": "Apple Headphones",
    "productPrice": "$169.99",
    "productRating": "4.7",
    "deliveryDate": "Thursday, April 3",
    "description": "PIONEERING HEARING — AirPods Pro 2 unlock the world’s first all-in-one hearing health experience: a seamlessly integrated hearing test, clinical-grade personalized audio hearing support.*\nINTELLIGENT AUDIO CONTROL — Adaptive Audio seamlessly blends Transparency mode to let outside sounds in, and Active Noise Cancellation to block unwanted background noise.¹ Transparency mode lets you hear the world around you, and Adaptive Audio seamlessly blends Active Noise Cancellation and Transparency mode for the best listening experience in any environment.¹ And when you’re interacting with someone nearby, Conversation Awareness automatically lowers the volume of what’s playing.\nIMPROVED SOUND AND CALL QUALITY — The Apple-designed H2 chip helps to create deeply immersive audio with three-dimensional sound. Adaptive EQ tunes music to your ears in real time for crisp, rich bass in stunning definition. Voice Isolation improves the quality of phone calls in loud conditions.²\nCUSTOMIZABLE FIT — Includes four pairs of silicone tips (XS, S, M, L) to fit a wide range of ear shapes and provide an all-day comfort. The tips create an acoustic seal to help keep out noise and secure AirPods Pro 2 in place.\nDUST, SWEAT, AND WATER RESISTANT — Both AirPods Pro and the MagSafe Charging Case are IP54 dust, sweat, and water resistant, so you can listen comfortably in more conditions.³\nPERSONALIZED SPATIAL AUDIO — With sound that suits your unique ear shape along with dynamic head tracking, AirPods Pro 2 deliver an immersive listening experience that places sound all around you.⁴ You can also listen to select songs, shows, and movies in Dolby Atmos.\nA HIGHER LEVEL OF CONTROL — Simply swipe, press, and hold the stem to manage playback. Automatically answer incoming calls, adjust volume, or end a call using just your voice with Siri. And hear your head rise when Siri asks if you’d like to hear a message, answer a call, or manage a notification.⁵\nLONGER BATTERY LIFE – Get up to 6 hours of listening time with Active Noise Cancellation enabled — 33% more than AirPods Pro (1st generation).⁶ The MagSafe Charging Case holds up to 30 hours total listening time with Active Noise Cancellation enabled.⁷ Simply charge the MagSafe Charging Case with an Apple Watch charger, MagSafe charger, USB-C connector, or Qi‑certified charger.\nMAGSAFE CHARGING CASE — The MagSafe Charging Case has a built‑in speaker for Case Find My and a lanyard loop.˄ Charge with an Apple Watch charger or MagSafe charger. Or use the USB-C connector or a Qi-certified charger.\nMAGICAL EXPERIENCE — Built-in speaker for Case Find My. Lanyard loop. Pair AirPods Pro 2 by simply placing them near your device and tapping Connect on your screen.⁸ AirPods Pro 2 intelligently pause when you take them off. Automatic Switching makes listening between your iPhone, iPad, and Mac completely effortless.⁹\nAPPLECARE — Get up to two years of unlimited incidents of accidental damage protection and priority access to Apple experts with AppleCare+.¹⁰",
    "imageUrl": [
      "https://m.media-amazon.com/images/I/61SUj2aKoEL._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81Zg3Ev2M5L._AC_SL1500_.jpg",
      "https://m.media-amazon.com/images/I/61n7MpBGeBL._AC_SL1500_.jpg"
    ]
  },
  {
    "productName": "Just Bare Chicken Natural Fresh Chicken Thighs | No Antibiotics Ever | Boneless | Skinless | 1.25 LB",
    "productSeller": "Amazonfresh",
    "productCategory": "Grocery (implied from Fresh)",
    "productPrice": "$5.49",
    "productRating": "4.7",
    "deliveryDate": "Tomorrow 11 AM - 1 PM",
    "description": "Raised with No Antibiotics Ever\nThird Party Humane Certified\nTraceable to Family Farms\nNo added Hormones or Steroids*\n*Federal regulations prohibit the use of hormones or steroids in poultry.",
    "imageUrl": [
      "https://m.media-amazon.com/images/I/818Kcrb7bIL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/81GMgAOk59L._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/813A1euwzRL._SL1500_.jpg"
    ]
  },
  {
    "productName": "Strawberries, 1 lb",
    "productSeller": "Amazonfresh",
    "productCategory": "Grocery (implied from Fresh)",
    "productPrice": "$1.79",
    "productRating": "4.6",
    "deliveryDate": "Tomorrow 11 AM - 1 PM",
    "description": "Recommend to wash before consumption.\nGrown in the United States, Chile, or Mexico\nDelicious on their own as a healthy snack or as part of a recipe",
    "imageUrl": [
      "https://m.media-amazon.com/images/I/8143FLAy6GL._SL1500_.jpg",
      "https://m.media-amazon.com/images/I/41BILLhhM6L.jpg",
      "https://m.media-amazon.com/images/I/31H5Ly2XotL.jpg"
    ]
  },
  {
    "productName": "Apple iPhone 16 Pro, US Version, 256GB, Black Titanium - Unlocked (Renewed)",
    "productSeller": "Networkstore",
    "productCategory": "Cell Phones & Accessories > Cell Phones",
    "productPrice": "$964.97",
    "productRating": "3.9",
    "deliveryDate": "Tuesday, April 8",
    "description": "This pre-owned product is not Apple certified, but has been professionally inspected, tested and cleaned by Amazon-qualified suppliers.\nThere will be no visible cosmetic imperfections when held at an arm's length.\nThis product will have a battery which exceeds 80% capacity relative to new.\nAccessories may not be original, but will be compatible and fully functional. Product may come in generic box.\nThis product is eligible for a replacement or refund within 90 days of receipt if you are not satisfied.",
    "imageUrl": [
      "https://m.media-amazon.com/images/I/31L1cQoEv5L._AC_.jpg",
      "https://m.media-amazon.com/images/I/41sMadjGWHL._AC_SX679_.jpg",
      "https://m.media-amazon.com/images/I/418F2n5w9aL._AC_SX679_.jpg"
    ]
  },
  {
    "productName": "Amazon Echo Show 10 (newest model) | HD smart display with premium sound, motion and Alexa, Glacier White",
    "productSeller": "Amazon.com",
    "productCategory": "Amazon Devices",
    "productPrice": "$249.99",
    "productRating": "4.5",
    "deliveryDate": "Sunday, April 6",
    "description": "Alexa can show you even more - With a 10.1\" HD screen that’s designed to move with you, video calls, recipes, and shows are always in view. The speakers deliver premium, directional sound.\nStay in frame - Video call friends and family or take a picture while the 13 MP camera with auto-framing and motion keeps you front and center.\nSmart home made simple - Set up compatible Zigbee devices or select smart devices without a separate hub. Ask Alexa to show you security cameras, control lights, and adjust thermostats.\nTake a look around when you’re away - Securely access the built-in camera to remotely monitor your home anytime with the Alexa app or other Echo Show devices.\nSo much entertainment - Ask Alexa to play your favorite shows, music, and podcasts from Prime Video, Netflix, Amazon Music, Spotify, and more.\nThe ultimate kitchen companion - Cook along with recipes on Food Network Kitchen, get unit conversions, set timers, add to your grocery list, and multitask with ease.\nPut your memories on display - Use Amazon Photos or Facebook for a picture perfect pairing. You can turn your home screen into a digital frame, invite friends and family to share photos, and even take photos. Plus, Prime members get unlimited photo storage.\nDesigned to protect your privacy - Amazon is not in the business of selling your personal information to others. Built with multiple layers of privacy controls including a mic/camera off button and a built-in camera shutter. Disable motion at any time.",
    "imageUrl": [
      "https://m.media-amazon.com/images/I/61hbVWn+K5L._AC_SL1000_.jpg",
      "https://m.media-amazon.com/images/I/51S35-8vhcL._AC_SL1000_.jpg",
      "https://m.media-amazon.com/images/I/612dd8TSH3L._AC_SL1000_.jpg"
    ]
  },
  {
    "productName": "Fitbit Inspire 3 Health &-Fitness-Tracker with Stress Management, Workout Intensity, Sleep Tracking, 24/7 Heart Rate and more, Midnight Zen/Black, One Size (S & L Bands Included)",
    "productSeller": "Amazon.com",
    "productCategory": "Sports & Outdoors > Exercise & Fitness > Fitness Technology > Activity & Fitness Trackers",
    "productPrice": "$69.95",
    "productRating": "4.4",
    "deliveryDate": "Thursday, April 3",
    "description": "Move more: Heart Rate on exercise equipment + Workout Intensity Map, Active Zone Minutes, all-day activity tracking and 24/7 heart rate, 20+ exercise modes, automatic exercise tracking and reminders to move\nStress less: always-on wellness tracking, daily Stress Management Score, mindfulness sessions, relax breathing sessions, irregular heart rhythm notifications, SpO2, menstrual health tracking, resting heart rate and high/low heart rate notifications\nSleep better: automatic sleep tracking, personalized Sleep Profile(1), daily detailed Sleep Score, smart wake vibrating alarm, sleep mode\nStay connected: call, text and smartphone app notifications, color touchscreen with customizable clock faces, super lightweight and water resistant to 50 meters, up to 10 day battery life(3)\nIncludes a 6-month Premium membership complete with personalized insights, advanced analytics and more (New & returning Premium users only. Must activate trial within 60-days of device activation. Content and features may change)\nIncluded in box: Fitbit Inspire 3 Tracker (Size Small and Large bands included). Wrist bands measure small 140 mm–180 mm with additional Large 180 mm–220 mm. Charger also included (compatible with Fitbit Luxe and Charge 5, not compatible with other models).",
    "imageUrl": [
      "https://m.media-amazon.com/images/I/51CtR+quteL._AC_SL1200_.jpg",
      "https://m.media-amazon.com/images/I/41ABMLgubsL._AC_SL1200_.jpg",
      "https://m.media-amazon.com/images/I/51RawFyXDtL._AC_SL1200_.jpg"
    ]
  }
]
